using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace Game_Service.Migrations
{
    /// <inheritdoc />
    public partial class m04 : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropColumn(
                name: "Country",
                table: "AspNetUsers");

            migrationBuilder.AlterColumn<string>(
                name: "DisplayName",
                table: "AspNetUsers",
                type: "nvarchar(50)",
                maxLength: 50,
                nullable: false,
                defaultValue: "",
                oldClrType: typeof(string),
                oldType: "nvarchar(50)",
                oldMaxLength: 50,
                oldNullable: true);

            migrationBuilder.AddColumn<int>(
                name: "CountryId",
                table: "AspNetUsers",
                type: "int",
                nullable: true);

            migrationBuilder.CreateTable(
                name: "Countries",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Name = table.Column<string>(type: "nvarchar(100)", maxLength: 100, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Countries", x => x.Id);
                });

            migrationBuilder.InsertData(
                table: "Countries",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Австралия" },
                    { 2, "Австрия" },
                    { 3, "Азербайджан" },
                    { 4, "Албания" },
                    { 5, "Алжир" },
                    { 6, "Американское Самоа" },
                    { 7, "Ангилья" },
                    { 8, "Ангола" },
                    { 9, "Андорра" },
                    { 10, "Антигуа и Барбуда" },
                    { 11, "Аргентина" },
                    { 12, "Армения" },
                    { 13, "Аруба" },
                    { 14, "Афганистан" },
                    { 15, "Багамы" },
                    { 16, "Бангладеш" },
                    { 17, "Барбадос" },
                    { 18, "Бахрейн" },
                    { 19, "Беларусь" },
                    { 20, "Белиз" },
                    { 21, "Бельгия" },
                    { 22, "Бенин" },
                    { 23, "Бермуды" },
                    { 24, "Болгария" },
                    { 25, "Боливия" },
                    { 26, "Бонайре, Синт-Эстатиус и Саба" },
                    { 27, "Босния и Герцеговина" },
                    { 28, "Ботсвана" },
                    { 29, "Бразилия" },
                    { 30, "Бруней-Даруссалам" },
                    { 31, "Буркина-Фасо" },
                    { 32, "Бурунди" },
                    { 33, "Бутан" },
                    { 34, "Вануату" },
                    { 35, "Ватикан" },
                    { 36, "Великобритания" },
                    { 37, "Венгрия" },
                    { 38, "Венесуэла" },
                    { 39, "Виргинские острова, Британские" },
                    { 40, "Виргинские острова, США" },
                    { 41, "Восточный Тимор" },
                    { 42, "Вьетнам" },
                    { 43, "Габон" },
                    { 44, "Гаити" },
                    { 45, "Гайана" },
                    { 46, "Гамбия" },
                    { 47, "Гана" },
                    { 48, "Гваделупа" },
                    { 49, "Гватемала" },
                    { 50, "Гвинея" },
                    { 51, "Гвинея-Бисау" },
                    { 52, "Германия" },
                    { 53, "Гибралтар" },
                    { 54, "Гондурас" },
                    { 55, "Гонконг" },
                    { 56, "Гренада" },
                    { 57, "Гренландия" },
                    { 58, "Греция" },
                    { 59, "Грузия" },
                    { 60, "Гуам" },
                    { 61, "Дания" },
                    { 62, "Джибути" },
                    { 63, "Доминика" },
                    { 64, "Доминиканская Республика" },
                    { 65, "Египет" },
                    { 66, "Замбия" },
                    { 67, "Западная Сахара" },
                    { 68, "Зимбабве" },
                    { 69, "Израиль" },
                    { 70, "Индия" },
                    { 71, "Индонезия" },
                    { 72, "Иордания" },
                    { 73, "Ирак" },
                    { 74, "Иран" },
                    { 75, "Ирландия" },
                    { 76, "Исландия" },
                    { 77, "Испания" },
                    { 78, "Италия" },
                    { 79, "Йемен" },
                    { 80, "Кабо-Верде" },
                    { 81, "Казахстан" },
                    { 82, "Камбоджа" },
                    { 83, "Камерун" },
                    { 84, "Канада" },
                    { 85, "Катар" },
                    { 86, "Кения" },
                    { 87, "Кипр" },
                    { 88, "Кирибати" },
                    { 89, "Китай" },
                    { 90, "Колумбия" },
                    { 91, "Коморы" },
                    { 92, "Конго" },
                    { 93, "Конго, демократическая республика" },
                    { 94, "Коста-Рика" },
                    { 95, "Кот д`Ивуар" },
                    { 96, "Куба" },
                    { 97, "Кувейт" },
                    { 98, "Кыргызстан" },
                    { 99, "Кюрасао" },
                    { 100, "Лаос" },
                    { 101, "Латвия" },
                    { 102, "Лесото" },
                    { 103, "Либерия" },
                    { 104, "Ливан" },
                    { 105, "Ливия" },
                    { 106, "Литва" },
                    { 107, "Лихтенштейн" },
                    { 108, "Люксембург" },
                    { 109, "Маврикий" },
                    { 110, "Мавритания" },
                    { 111, "Мадагаскар" },
                    { 112, "Макао" },
                    { 113, "Македония" },
                    { 114, "Малави" },
                    { 115, "Малайзия" },
                    { 116, "Мали" },
                    { 117, "Мальдивы" },
                    { 118, "Мальта" },
                    { 119, "Марокко" },
                    { 120, "Мартиника" },
                    { 121, "Маршалловы Острова" },
                    { 122, "Мексика" },
                    { 123, "Микронезия, федеративные штаты" },
                    { 124, "Мозамбик" },
                    { 125, "Молдова" },
                    { 126, "Монако" },
                    { 127, "Монголия" },
                    { 128, "Монтсеррат" },
                    { 129, "Мьянма" },
                    { 130, "Намибия" },
                    { 131, "Науру" },
                    { 132, "Непал" },
                    { 133, "Нигер" },
                    { 134, "Нигерия" },
                    { 135, "Нидерланды" },
                    { 136, "Никарагуа" },
                    { 137, "Ниуэ" },
                    { 138, "Новая Зеландия" },
                    { 139, "Новая Каледония" },
                    { 140, "Норвегия" },
                    { 141, "Объединенные Арабские Эмираты" },
                    { 142, "Оман" },
                    { 143, "Остров Мэн" },
                    { 144, "Остров Норфолк" },
                    { 145, "Острова Кайман" },
                    { 146, "Острова Кука" },
                    { 147, "Острова Теркс и Кайкос" },
                    { 148, "Пакистан" },
                    { 149, "Палау" },
                    { 150, "Палестинская автономия" },
                    { 151, "Панама" },
                    { 152, "Папуа - Новая Гвинея" },
                    { 153, "Парагвай" },
                    { 154, "Перу" },
                    { 155, "Питкерн" },
                    { 156, "Польша" },
                    { 157, "Португалия" },
                    { 158, "Пуэрто-Рико" },
                    { 159, "Реюньон" },
                    { 160, "Россия" },
                    { 161, "Руанда" },
                    { 162, "Румыния" },
                    { 163, "США" },
                    { 164, "Сальвадор" },
                    { 165, "Самоа" },
                    { 166, "Сан-Марино" },
                    { 167, "Сан-Томе и Принсипи" },
                    { 168, "Саудовская Аравия" },
                    { 169, "Свазиленд" },
                    { 170, "Святая Елена" },
                    { 171, "Северная Корея" },
                    { 172, "Северные Марианские острова" },
                    { 173, "Сейшелы" },
                    { 174, "Сенегал" },
                    { 175, "Сент-Винсент" },
                    { 176, "Сент-Китс и Невис" },
                    { 177, "Сент-Люсия" },
                    { 178, "Сент-Пьер и Микелон" },
                    { 179, "Сербия" },
                    { 180, "Сингапур" },
                    { 181, "Синт-Мартен" },
                    { 182, "Сирийская Арабская Республика" },
                    { 183, "Словакия" },
                    { 184, "Словения" },
                    { 185, "Соломоновы Острова" },
                    { 186, "Сомали" },
                    { 187, "Судан" },
                    { 188, "Суринам" },
                    { 189, "Сьерра-Леоне" },
                    { 190, "Таджикистан" },
                    { 191, "Таиланд" },
                    { 192, "Тайвань" },
                    { 193, "Танзания" },
                    { 194, "Того" },
                    { 195, "Токелау" },
                    { 196, "Тонга" },
                    { 197, "Тринидад и Тобаго" },
                    { 198, "Тувалу" },
                    { 199, "Тунис" },
                    { 200, "Туркменистан" },
                    { 201, "Турция" },
                    { 202, "Уганда" },
                    { 203, "Узбекистан" },
                    { 204, "Украина" },
                    { 205, "Уоллис и Футуна" },
                    { 206, "Уругвай" },
                    { 207, "Фарерские острова" },
                    { 208, "Фиджи" },
                    { 209, "Филиппины" },
                    { 210, "Финляндия" },
                    { 211, "Фолклендские острова" },
                    { 212, "Франция" },
                    { 213, "Французская Гвиана" },
                    { 214, "Французская Полинезия" },
                    { 215, "Хорватия" },
                    { 216, "Центрально-Африканская Республика" },
                    { 217, "Чад" },
                    { 218, "Черногория" },
                    { 219, "Чехия" },
                    { 220, "Чили" },
                    { 221, "Швейцария" },
                    { 222, "Швеция" },
                    { 223, "Шпицберген и Ян Майен" },
                    { 224, "Шри-Ланка" },
                    { 225, "Эквадор" },
                    { 226, "Экваториальная Гвинея" },
                    { 227, "Эритрея" },
                    { 228, "Эстония" },
                    { 229, "Эфиопия" },
                    { 230, "Южная Корея" },
                    { 231, "Южно-Африканская Республика" },
                    { 232, "Южный Судан" },
                    { 233, "Ямайка" },
                    { 234, "Япония" }
                });

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUsers_CountryId",
                table: "AspNetUsers",
                column: "CountryId");

            migrationBuilder.CreateIndex(
                name: "IX_Countries_Name",
                table: "Countries",
                column: "Name",
                unique: true);

            migrationBuilder.AddForeignKey(
                name: "FK_AspNetUsers_Countries_CountryId",
                table: "AspNetUsers",
                column: "CountryId",
                principalTable: "Countries",
                principalColumn: "Id",
                onDelete: ReferentialAction.SetNull);
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropForeignKey(
                name: "FK_AspNetUsers_Countries_CountryId",
                table: "AspNetUsers");

            migrationBuilder.DropTable(
                name: "Countries");

            migrationBuilder.DropIndex(
                name: "IX_AspNetUsers_CountryId",
                table: "AspNetUsers");

            migrationBuilder.DropColumn(
                name: "CountryId",
                table: "AspNetUsers");

            migrationBuilder.AlterColumn<string>(
                name: "DisplayName",
                table: "AspNetUsers",
                type: "nvarchar(50)",
                maxLength: 50,
                nullable: true,
                oldClrType: typeof(string),
                oldType: "nvarchar(50)",
                oldMaxLength: 50);

            migrationBuilder.AddColumn<string>(
                name: "Country",
                table: "AspNetUsers",
                type: "nvarchar(100)",
                maxLength: 100,
                nullable: true);
        }
    }
}
